{"responseData": {"feed":{"feedUrl":"https://www.inigame.id/feed/","title":"INIGAME","link":"https://www.inigame.id","author":"","description":"Indonesia game news, industry \u0026 events","type":"rss20","entries":[{"title":"Giveaway Counter Strike Complete Edition GRATIS","link":"https://www.inigame.id/giveaway-counter-strike-complete-edition-gratis/","author":"Andreas Angga Radhika","publishedDate":"Mon, 01 Aug 2016 07:56:04 -0700","contentSnippet":"INIGAME.ID – Memperingati Awal Agustus 2016, INIGAME bersama MOL Indonesia akan membagikan 1 buah Counter Strike Complete ...","content":"\u003cp\u003e\u003cstrong\u003eINIGAME.ID\u003c/strong\u003e – Memperingati Awal Agustus 2016,\u003cstrong\u003e INIGAME \u003c/strong\u003ebersama \u003cstrong\u003eMOL Indonesia\u003c/strong\u003e\u003cb\u003e \u003c/b\u003eakan membagikan 1 buah \u003cem\u003eCounter Strike Complete Edition\u003c/em\u003e GRATIS untuk para \u003cem\u003egamers\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e[INIGAME \u0026amp; MOL] Giveaway Counter Strike Complete Edition GRATIS \u003c/em\u003e dimulai sejak 01 Agustus  2016 – 08 Agustus 2016, dan untuk syarat partisipasinya sangatlah mudah.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eGamers\u003c/em\u003e hanya perlu menulisakan \u003cem\u003eemail \u003c/em\u003edan mengikuti langkah pada \u003cem\u003eform\u003c/em\u003e di bawah dan secara otomatis pada akhir event, \u003cstrong\u003e1 pemenang\u003c/strong\u003e yang beruntung masing-masaing akan mendapatkan \u003cstrong\u003e1 Counter Strike Complete Edition \u003c/strong\u003eGRATIS.\u003c/p\u003e\n\u003cp style\u003d\"text-align:center\"\u003e\u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003ch2\u003eWinner Tips\u003c/h2\u003e\n\u003cp\u003e\u003cem\u003eKamu juga dapat memanfaatkan link dari Share with your Friends untuk mendapatkan Extra Entries dari setiap teman yang mengunjungi link dari kamu.\u003c/em\u003e\u003c/p\u003e\n\u003cdiv\u003e\u003cdiv\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/valve-surat-ancaman-situs-betting/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Valve Mulai Mengirim Surat Ancaman ke Situs Betting DotA 2 dan CS:GO \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/harga-skin-csgo-pasca-kebijakan-valve/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e INI Kondisi Harga Skin CS:GO Pasca Kebijakan Valve Terkait Gambling \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/valve-mulai-serius-tindak-betting/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Valve akan Mulai Serius Menindak Website Betting \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e \n\u003c/div\u003e   \u003cp\u003eThe post \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id/giveaway-counter-strike-complete-edition-gratis/\"\u003eGiveaway Counter Strike Complete Edition GRATIS\u003c/a\u003e appeared first on \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id\"\u003eINIGAME\u003c/a\u003e.\u003c/p\u003e","categories":["Editor\u0026#39;s Choice","Events","Giveaway","Counter Strike","cs:go"]},{"title":"Pria INI Dapatkan Perjalanan Gratis ke Seluruh Dunia untuk Melengkapi Koleksi Pokemon","link":"https://www.inigame.id/pria-dapatkan-perjalanan-gratis-pokemon-go/","author":"Theofilus Ifan","publishedDate":"Sun, 31 Jul 2016 22:41:49 -0700","contentSnippet":"INIGAME.ID \u0026#8211; Menangkap semua monster di Pokemon GO merupakan salah satu impian para gamers. Berbagai cara pun dilakukan, ...","content":"\u003cp\u003e\u003cstrong\u003eINIGAME.ID – \u003c/strong\u003eMenangkap semua monster di Pokemon GO merupakan salah satu impian para \u003cem\u003egamers\u003c/em\u003e. Berbagai cara pun dilakukan, mulai dari menjelajahi tempat baru, sampai menggunakan \u003cem\u003emap hack\u003c/em\u003e. Lalu bagaimana jadinya jika ada seorang \u003cem\u003egamer\u003c/em\u003e yang dibiayai untuk mengejar Pokemon di seluruh belahan dunia?\u003c/p\u003e\n\u003cp\u003eAlangkah beruntungnya Nick Johnson, seorang pemuda asal Brooklyn. Ia mengaku orang pertama yang berhasil menangkap 142 dari 151 Pokemon. Sisa Pokemon yang belum ditangkap adalah 6 Pokemon langka yang kabarnya belum disebar, dan tiga Pokemon eksklusif yang hanya ada di wilayah tertentu.\u003c/p\u003e\n\u003cp\u003e\u003cimg src\u003d\"https://www.inigame.id/wp-content/uploads/2016/08/nick-johnson-pokedex-.jpg\" alt\u003d\"nick johnson pokedex\" width\u003d\"700\" height\u003d\"1244\"\u003e\u003c/p\u003e\n\u003cp\u003eDan demi melengkapi koleksi Pokemon-nya ini, Johnson mendapatkan layanan perjalanan gratis ke seluruh dunia yang disponsori oleh Marriot Rewards dan Expedia.com.\u003c/p\u003e\n\u003cp\u003eParis merupakan tempat pertama yang dikunjungi Johnson bersama dengan kekasihnya pada Jumat sore, yang ditanggung biayanya oleh Expedia.com. Tujuan Johnson adalah menangkap Mr.Mime.\u003c/p\u003e\n\u003cp\u003eKeesokan harinya, mereka menjelajahi Hong Kong untuk mencari Farfetch’d, dan besoknya langsung pergi ke Sydney selama dua hari. Di Sydney, mereka menghabiskan waktu untuk menangkap Kangaskhan. Perjalanan Johnson akan berakhir di Tokyo untuk selama beberapa hari dan menikmati waktu libur di sana.\u003c/p\u003e\n\u003cp\u003eJohnson mengaku, selama perjalanan ia mengandalkan pemain Pokemon GO setempat untuk bertukar informasi mengenai keberadaan Pokemon yang dicarinya. Dalam pencariannya, Johnson tidak mau menggunakan \u003cem\u003emap hack\u003c/em\u003e, seperti Pokevision.\u003c/p\u003e\n\u003cp\u003e“Pada dasarnya saya akan mejelajahi tiap tempat, tetap mencari meskipun jauh dan melelahkan,” ujar Johnson.\u003c/p\u003e\n\u003cp\u003ePenginapan Johnson yang disponsori Marriot bisa membuat \u003cem\u003egamers\u003c/em\u003e iri. Pasalnya, ia menginap di \u003ca href\u003d\"http://www.marriott.com/hotels/travel/parwg-renaissance-paris-arc-de-triomphe-hotel/?scid\u003dbb1a189a-fec3-4d19-a255-54ba596febe2\"\u003e\u003cstrong\u003eRennaissance Paris Arc de Triomphe\u003c/strong\u003e\u003c/a\u003e, \u003ca href\u003d\"http://www.marriott.com/hotels/travel/hkghv-renaissance-hong-kong-harbour-view-hotel/?scid\u003dbb1a189a-fec3-4d19-a255-54ba596febe2\"\u003e\u003cstrong\u003eRennaisance Hong Kong Harbour View\u003c/strong\u003e\u003c/a\u003e, \u003ca href\u003d\"http://www.marriott.com/hotels/travel/sydak-pier-one-sydney-harbour-autograph-collection/?scid\u003dbb1a189a-fec3-4d19-a255-54ba596febe2\"\u003e\u003cstrong\u003ePier One Sydney Harbour\u003c/strong\u003e\u003c/a\u003e, dan \u003ca href\u003d\"http://www.marriott.com/hotels/travel/tyomc-tokyo-marriott-hotel/?scid\u003dbb1a189a-fec3-4d19-a255-54ba596febe2\"\u003e\u003cstrong\u003eTokyo Marriot Hotel\u003c/strong\u003e\u003c/a\u003e, tanpa mengeluarkan uang sama sekali.\u003c/p\u003e\n\u003cp\u003e\u003cimg src\u003d\"https://www.inigame.id/wp-content/uploads/2016/08/marriot-hotel-untuk-nick-johnson-.jpg\" alt\u003d\"marriot hotel untuk nick johnson\" width\u003d\"700\" height\u003d\"321\"\u003e\u003c/p\u003e\n\u003cp\u003eHasil dari perjalanan ini, Johnson menjadi Poke-celebrity. Ia telah diwawancara di berbagai TV dan koran. Ia juga sempat hadir di acara Good Morning America. Bahkan, karena demikian terkenalnya, salah satu supir Uber meminta selfie dengan Johnson untuk ditunjukan pada anaknya.\u003c/p\u003e\n\u003cp\u003eTampaknya segala sesuatu yang benar-benar diseriuskan akan menjadi sebuah hal menarik yang layak untuk didukung dan dibanggakan ya, \u003cem\u003egamers\u003c/em\u003e? Bagaimana dengan kalian? Sudah seberapa lengkap koleksi Pokemon di Pokedex?\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThanks to\u003c/em\u003e \u003ca href\u003d\"http://www.businessinsider.co.id/nik-johnson-gets-worldwide-trip-to-catch-pokemon-2016-7/?r\u003dUS\u0026amp;IR\u003dT\"\u003e\u003cstrong\u003eBusiness Insider\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cdiv\u003e\u003cdiv\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/gamers-bisa-menghitung-potensi-evolusi-pokemon-go/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Dengan Kalkulator Pokemon GO INI, Gamers dapat Menghitung Potensi CP Setiap Evol... \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/capai-lv-40-di-pokemon-go-gamers-ini-langsung-hapus-akun/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Capai Lv 40 di Pokemon Go, Gamers INI Langsung Hapus Akun \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/pokemon-go-plus-diundur-sampai-september-2016/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Pokemon GO Plus Diundur sampai September 2016 \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e \n\u003c/div\u003e   \u003cp\u003eThe post \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id/pria-dapatkan-perjalanan-gratis-pokemon-go/\"\u003ePria INI Dapatkan Perjalanan Gratis ke Seluruh Dunia untuk Melengkapi Koleksi Pokemon\u003c/a\u003e appeared first on \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id\"\u003eINIGAME\u003c/a\u003e.\u003c/p\u003e","categories":["News","nick johnson","pokémon go!"]},{"title":"AMD Perkenalkan RX 470 dan RX 460, Kartu Grafis untuk Mid Class Gamers dan Atlet eSports","link":"https://www.inigame.id/amd-perkenalkan-rx-470-rx-460/","author":"Vincent Suryaputra","publishedDate":"Sun, 31 Jul 2016 01:11:19 -0700","contentSnippet":"INIGAME.ID \u0026#8211; AMD sepertinya tidak cukup puas membuat kaget para konsumennya dengan menghadirkan RX 480 sebagai kartu ...","content":"\u003cp\u003e\u003cstrong\u003eINIGAME.ID\u003c/strong\u003e – AMD sepertinya tidak cukup puas membuat kaget para konsumennya dengan menghadirkan RX 480 sebagai kartu grafis memumpuni dengan harga “murah”. Pasalnya, beberapa waktu lalu, perusahaan ini telah mulai membocorkan informasi kehadiran RX 470 dan RX 460, yang tentunya akan dipatok lebih murah lagi.\u003c/p\u003e\n\u003cp\u003eBagi yang belum tahu, kehadiran versi murah dari kartu grafis berteknologi Polaris ini memang telah dijanjikan sebelumnya oleh AMD saat memperkenalkan RX 480. Akan tetapi, saat itu, sama sekali tidak ada informasi sedikitpun mengenai kemampuan yang akan diusungnya.\u003c/p\u003e\n\u003cp\u003eKini AMD telah mulai memberikan beberapa detail penting untuk \u003cem\u003egamers\u003c/em\u003e perhatikan. Satu hal yang pasti, kedua seri ini bukan kartu grafis yang mampu menjalankan teknologi VR seperti RX 480. Selebihnya, berikut penjelasannya.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eRX 470\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eRX 470 kabarnya memiliki kekuatan 4,9 \u003cem\u003eteraflops\u003c/em\u003e, 4 GB VRAM dalam memori 256 bit, dan membutuhkan daya sekitar 120 watt. Seri ini juga mendukung DiractX 12, Vulkan, hingga kualitas visual mencapai 60 \u003cem\u003eframes per second\u003c/em\u003e, HDR, hingga resolusi sampai 4K.\u003c/p\u003e\n\u003cp\u003e\u003cimg src\u003d\"https://www.inigame.id/wp-content/uploads/2016/07/amd-radeon-rx-470-.jpg\" alt\u003d\"amd radeon rx 470\" width\u003d\"700\" height\u003d\"198\"\u003e\u003c/p\u003e\n\u003cp\u003eDengan spesifikasi tersebut (yang dapat \u003cem\u003egamers\u003c/em\u003e baca selengkapnya di \u003ca href\u003d\"http://www.amd.com/en-us/products/graphics/radeon-rx-series/radeon-rx-470\"\u003e\u003cstrong\u003e\u003cem\u003ewebsite\u003c/em\u003e AMD\u003c/strong\u003e\u003c/a\u003e), kartu grafis ini diperuntukkan bagi para \u003cem\u003egamers\u003c/em\u003e yang menginginkan performa menengah ke atas.\u003c/p\u003e\n\u003ch2\u003e\u003cstrong\u003eRX 460\u003c/strong\u003e\u003c/h2\u003e\n\u003cp\u003eSementara untuk RX 460, kartu grafis yang memiliki bentuk kecil mirip seperti Radeon R9 Nano ini akan mengusung kekuatan 2,2 \u003cem\u003eteraflops\u003c/em\u003e, 2 GB VRAM dalam memori 128 bit, dan membutuhkan daya hanya sekitar 75 watt.\u003c/p\u003e\n\u003cp\u003e\u003cimg src\u003d\"https://www.inigame.id/wp-content/uploads/2016/07/amd-radeon-rx-460-.jpg\" alt\u003d\"amd radeon rx 460\" width\u003d\"700\" height\u003d\"263\"\u003e\u003c/p\u003e\n\u003cp\u003eSeri ini sepertinya diperuntukkan bagi \u003cem\u003eprofesional gamers\u003c/em\u003e atau atlet eSports yang biasanya fokus pada beberapa game saja. Karena dalam \u003ca href\u003d\"http://www.amd.com/en-us/products/graphics/radeon-rx-series/radeon-rx-460\"\u003e\u003cstrong\u003e\u003cem\u003ewebsite\u003c/em\u003e AMD\u003c/strong\u003e\u003c/a\u003e, dipastikan seri ini cocok untuk menjalankan League of Legends, Overwatch, hingga DotA 2 yang notabene merupakan game di ranah eSports.\u003c/p\u003e\n\u003cp\u003eSayangnya, pihak AMD masih belum memberikan kabar mengenai rencana harga untuk kedua kartu grafis ini. Akan tetapi, jika di Indonesia saja RX 48RX dipatok seharga \u003ca href\u003d\"https://store.inigame.id/beli-hardware/100-beli-powercolor-radeon-rx-480-8gb-gddr5.html\"\u003e\u003cstrong\u003eRp3,8 juta\u003c/strong\u003e\u003c/a\u003e, sepertinya kedua kartu ini bisa menyentuh angka sekitar Rp2,5 – 1,5 juta. Meskipun begitu, tetap tidak ada yang tahu sampai perusahaan ini secara resmi memperkenalkannya kepada publik.\u003c/p\u003e\n\u003cp\u003eLalu, bagaimana menurut \u003cem\u003egamers\u003c/em\u003e? Tertarik untuk melirik kedua saudara terdekat RX 480 ini?\u003c/p\u003e\n\u003cdiv\u003e\n\u003c/div\u003e   \u003cp\u003eThe post \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id/amd-perkenalkan-rx-470-rx-460/\"\u003eAMD Perkenalkan RX 470 dan RX 460, Kartu Grafis untuk Mid Class Gamers dan Atlet eSports\u003c/a\u003e appeared first on \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id\"\u003eINIGAME\u003c/a\u003e.\u003c/p\u003e","categories":["News","PC","amd rx 460","amd rx 470","amd rx 480","polaris"]},{"title":"Kanaya Gaming Berhasil Jadi Juara LGS Keempat Kalinya secara Berturut-turut","link":"https://www.inigame.id/kanaya-gaming-juara-lgs-empat-kali/","author":"Vincent Suryaputra","publishedDate":"Sat, 30 Jul 2016 16:29:04 -0700","contentSnippet":"INIGAME.ID \u0026#8211; Melalui turnamen The Finals 2016 yang berlangsung di Balai Sarbini, Jakarta, pada 30 Juli 2016, Kanaya ...","content":"\u003cp\u003e\u003cstrong\u003eINIGAME.ID\u003c/strong\u003e – Melalui turnamen The Finals 2016 yang berlangsung di Balai Sarbini, Jakarta, pada 30 Juli 2016, Kanaya Gaming membuktikan kualitas dan kemampuan mereka kepada publik untuk terus mempertahankan gelar sebagai Juara LoL Garuda Series (LGS), setelah mengalahkan Revival eSports dengan skor telak 3-0.\u003c/p\u003e\n\u003cp\u003e\u003cimg src\u003d\"https://www.inigame.id/wp-content/uploads/2016/07/Trofi-LGS-.jpg\" alt\u003d\"Trofi LGS\" width\u003d\"700\" height\u003d\"468\"\u003e\u003c/p\u003e\n\u003cp\u003eSedikit melihat ke belakang, Kanaya memang telah tampil tajam sejak babak penyisihan dan perebutan tiket The Finals 2016. Salah satu lawan berat yang mereka temui saat itu adalah Fortius Gaming, tim yang berisikan berbagai pemain bertalenta tinggi dan menjuarai LGS selama tiga \u003cem\u003eseason\u003c/em\u003e berturut-turut, saat masih menggunakan nama Jakarta Juggernauts dan XcN. Meskipun begitu, nyatanya Kanaya tetap mampu memastikan langkahnya ke babak final menghadapi Revival eSports.\u003c/p\u003e\n\u003cp\u003eIbarat mengulang cerita indah dari The Finals sebelumnya, permainan apik kembali disuguhkan oleh Ruben “rubeN” Sutanto dan Kenny “TheChupper” Marcellino. Kedua pemain ini sekali lagi menjadi kunci bagi kemenangan Kanaya di Balai Sarbini, membuat The Finals seolah memang digelar khusus untuk mereka berdua.\u003c/p\u003e\n\u003cp\u003e“Untuk mempersiapkan LGS kali ini, kami berlatih selama 12 jam setiap harinya dengan menyusun strategi sematang mungkin untuk mempertahankan gelar juara,” jelas para atlet eSports Kanaya yang beranggotakan Andre “Andre”, Hartanto “Pokka”, Kenny “TheChupper”, Ruben “Ruben”, dan Tobias “Oceans11” dan dilatih oleh Coach Brian “Banana”.\u003c/p\u003e\n\u003cp\u003e\u003cimg src\u003d\"https://www.inigame.id/wp-content/uploads/2016/07/para-pemenang-LGS-.jpg\" alt\u003d\"para pemenang LGS\" width\u003d\"700\" height\u003d\"409\"\u003e\u003c/p\u003e\n\u003cp\u003eKembali menjadi juara pada turnamen ini menjadikan Kanaya sebagai tim League of Legends Indonesia pertama yang mampu menjuarai LGS selama empat musim berturut-turut. Di tahun ini, mereka membawa pulang uang tunai sejumlah Rp100 juta dan biaya operasional sebesar Rp7 juta, sekaligus tiket untuk mewakili Indonesia dalam ajang International 2016 Garena Premiere League Summer di Vietnam.\u003c/p\u003e\n\u003cp\u003eInformasi mengenai The Finals 2016 Garena LGS Summer dan turnamen League of Legends yang diselenggarakan Garena Indonesia lainnya dapat didapatkan melalui \u003ca href\u003d\"https://www.facebook.com/garenalolesportsid/?fref\u003dts\"\u003e\u003cstrong\u003eFacebook Page LoL Esports Indonesia\u003c/strong\u003e\u003c/a\u003e, \u003ca href\u003d\"https://twitter.com/GarenaLoLID/\"\u003e\u003cstrong\u003eTwitter\u003c/strong\u003e\u003c/a\u003e, dan \u003ca href\u003d\"https://lol.garena.co.id/\"\u003e\u003cstrong\u003e\u003cem\u003ewebsite\u003c/em\u003e League of Legends Indonesia\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eGamers\u003c/em\u003e yang ketinggalan melihat pertandingan final kemarin dapat langsung menonton jalannya pertandingan selengkapnya di video berikut.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eCongratulations\u003c/em\u003e Kanaya Gaming!!\u003c/p\u003e\n\u003cp\u003e\u003ciframe src\u003d\"https://www.youtube.com/embed/dNFKkxtGq84\" width\u003d\"560\" height\u003d\"315\" frameborder\u003d\"0\" allowFullScreen\u003d\"allowfullscreen\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cdiv\u003e\u003cdiv\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/kled-champion-terbaru-di-league-legends/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Kenalan Dulu dengan Kled, Champion Terbaru di League of Legends \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/valencia-tim-league-legends/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Setelah Hearthstone dan Rocket League, Valencia FC Perkenalkan Tim League of Leg... \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/overwatch-kalahkan-league-of-legends-korea/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Salip Posisi League of Legends, Overwatch Kini Menjadi Game Terpopuler di Warnet... \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e \n\u003c/div\u003e   \u003cp\u003eThe post \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id/kanaya-gaming-juara-lgs-empat-kali/\"\u003eKanaya Gaming Berhasil Jadi Juara LGS Keempat Kalinya secara Berturut-turut\u003c/a\u003e appeared first on \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id\"\u003eINIGAME\u003c/a\u003e.\u003c/p\u003e","categories":["eSports","News","kanaya gaming","league of legends","lgs","lol garuda series","revival e-sports"]},{"title":"Atlet Sepakbola Peraih Gol Terbaik Dunia Tahun 2015 INI Pensiun untuk Menjadi Pemain Game FIFA","link":"https://www.inigame.id/wendell-lira-pensiun-demi-fifa/","author":"Vincent Suryaputra","publishedDate":"Sat, 30 Jul 2016 03:46:08 -0700","contentSnippet":"INIGAME.ID \u0026#8211; Di saat beberapa orang masih ada yang memandang enteng profesi seorang pemain game profesional, di Brazil, ...","content":"\u003cp\u003e\u003cstrong\u003eINIGAME.ID\u003c/strong\u003e – Di saat beberapa orang masih ada yang memandang enteng profesi seorang pemain game profesional, di Brazil, seorang atlet sepakbola profesional Wendell Lira malah pensiun dari karir utamanya ini untuk menjadi pemain game FIFA sepenuhnya.\u003c/p\u003e\n\u003cp\u003e\u003cimg src\u003d\"https://www.inigame.id/wp-content/uploads/2016/07/wendel-lira-play-fifa-.jpg\" alt\u003d\"wendel lira play fifa\" width\u003d\"700\" height\u003d\"426\"\u003e\u003c/p\u003e\n\u003cp\u003eSeperti yang dikutip dari \u003ca href\u003d\"http://www.businessinsider.com.au/wendell-lira-retires-to-play-fifa-full-time-2016-7\"\u003e\u003cstrong\u003eBusiness Insider\u003c/strong\u003e\u003c/a\u003e, Lira bukan sekadar hobi memainkan game FIFA. Pada 6 November 2015 lalu, ia telah menghadapi juara game FIFA pada saat itu, Abdulaziz Alshehri, seorang \u003cem\u003egamer\u003c/em\u003e dari Arab Saudi. Menggunakan Real Madrid untuk mengalahkan Barcelona, Lira berhasil mengalahkan Alshehri dengan skor telak 6-1.\u003c/p\u003e\n\u003cp\u003eSayangnya pertandingan saat itu bukan pertandingan resmi, sehingga Lira masih belum mendapatkan gelar apapun atas kemenangannya saat itu. Sekadar informasi, untuk bisa mendapatkan peringkat atau gelar, seorang \u003cem\u003egamer\u003c/em\u003e harus berkompetisi di pertandingan resmi FIFA Interactive World Cup.\u003c/p\u003e\n\u003cp\u003eSebelumnya, mungkin \u003cem\u003egamers\u003c/em\u003e belum pernah mendengar siapa itu Wendel Lira. Bagi yang belum tahu, ia merupakan peraih penghargaan FIFA 2015 Puskás Award dengan gol terbaiknya di tahun 2015. \u003cem\u003eGamers\u003c/em\u003e dapat melihat cuplikan aksi golnya ini di video di akhir nanti.\u003c/p\u003e\n\u003cp\u003e\u003cimg src\u003d\"https://www.inigame.id/wp-content/uploads/2016/07/wendel-lira-puskas-award-.jpg\" alt\u003d\"wendel lira puskas award\" width\u003d\"700\" height\u003d\"394\"\u003e\u003c/p\u003e\n\u003cp\u003eLalu, bagaimana langkah Lira untuk mulai menggeluti bidang barunya ini? Ternyata ia telah memulai membangun \u003ca href\u003d\"https://www.youtube.com/channel/UC6l5ZxxL1uVq0SKpdqYefvw?sub_confirmation\u003d1\"\u003e\u003cstrong\u003eYouTube Channel\u003c/strong\u003e\u003c/a\u003e miliknya yang bertujuan untuk menunjukkan sisi dirinya sebagai seorang \u003cem\u003egamer\u003c/em\u003e kepada seluruh dunia.\u003c/p\u003e\n\u003cp\u003ePerkembangan sisi profesional dari game FIFA bukan hal yang baru lagi. Beberapa klub sepakbola besar seperti Manchester City, West Ham, dan Valencia telah secara resmi memperkenalkan tim mereka di sektor eSports untuk cabang FIFA.\u003c/p\u003e\n\u003cp\u003eTampaknya tidak menutup kemungkinan para \u003cem\u003efans\u003c/em\u003e FIFA akan mulai melirik pertandingan sepakbola versi eSports di akan datang. Bagaimana menurut \u003cem\u003egamers\u003c/em\u003e? Dan seperti yang telah dijanjikan tadi, berikut adalah cuplikan aksi Wendell Lira saat menciptakan gol terbaik sepanjang tahun 2015.\u003c/p\u003e\n\u003cp\u003e\u003ciframe src\u003d\"https://www.youtube.com/embed/et7f0gc9VpY\" width\u003d\"560\" height\u003d\"315\" frameborder\u003d\"0\" allowFullScreen\u003d\"allowfullscreen\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cdiv\u003e\u003cdiv\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/premier-championship-wakil-indonesia-di-shanghai/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e FIFA Online 3 Hadirkan Premier Championship untuk Mecari Wakil Indonesia di Shan... \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e \n\u003c/div\u003e   \u003cp\u003eThe post \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id/wendell-lira-pensiun-demi-fifa/\"\u003eAtlet Sepakbola Peraih Gol Terbaik Dunia Tahun 2015 INI Pensiun untuk Menjadi Pemain Game FIFA\u003c/a\u003e appeared first on \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id\"\u003eINIGAME\u003c/a\u003e.\u003c/p\u003e","categories":["eSports","fifa","wendell lira"]},{"title":"Capcom Bocorkan Proyek Terbarunya, Berjudul Project Palm","link":"https://www.inigame.id/capcom-bocorkan-project-palm/","author":"Theofilus Ifan","publishedDate":"Fri, 29 Jul 2016 22:30:10 -0700","contentSnippet":"INIGAME.ID \u0026#8211; Capcom baru-baru ini merilis laman teaser baru dalam mempromosikan game terbarunya. Hal ini sebenarnya cukup ...","content":"\u003cp\u003e\u003cstrong\u003eINIGAME.ID – \u003c/strong\u003eCapcom baru-baru ini merilis laman \u003cem\u003eteaser \u003c/em\u003ebaru dalam mempromosikan game terbarunya. Hal ini sebenarnya cukup mengejutkan karena terkesan mendadak. Capcom tidak memberi tahu mengenai proyek yang sedang mereka kerjakan, yang diberi nama \u003cstrong\u003e\u003ca href\u003d\"http://www.capcom.co.jp/palm/\"\u003eProject Palm\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eSesuai namanya, bila \u003cem\u003egamers\u003c/em\u003e membuka laman itu, hal pertama yang terlihat adalah sebuah telapak tangan. Di bagian bawah, kita bisa menemukan profil salah satu pengisi suara dalam projek ini, yaitu Yuichiro Umehara.\u003c/p\u003e\n\u003cp\u003e\u003cimg src\u003d\"https://www.inigame.id/wp-content/uploads/2016/07/project-pam-teaser-video-.jpg\" alt\u003d\"project pam teaser video\" width\u003d\"700\" height\u003d\"394\"\u003e\u003c/p\u003e\n\u003cp\u003eYuchiro sendiri pernah mengisi suara beberapa anime seperti Pokemon: XY sebagai Orinisu, dan Mobile Suit Gundam: Iron-Blooded Orphans sebagai Eugene Sevenstark.\u003c/p\u003e\n\u003cp\u003eSejauh ini, Capcom belum memberi keterangan lebih lanjut mengenai proyek ini. Namun ada kemungkinan Project Palm ada hubungannya dengan Dragon’s Dogma, salah satu game RPG buatan Capcom.\u003c/p\u003e\n\u003cp\u003eBagi \u003cem\u003egamers\u003c/em\u003e yang sudah pernah memainkan Dragon’s Dogma, tentu tidak asing dengan telapak tangan di laman Project Palm. Pasalnya, beberapa karakter dari Dragon’s Dogma memiliki luka yang serupa.\u003c/p\u003e\n\u003cp\u003eGame ini akan dirilis pada tanggal 2 Agustus 2016. Dalam kurun waktu tersebut, belum diketahui apakah Capcom akan memberi informasi lebih lanjut mengenai game ini, atau tetap membiarkan kesan misterius.\u003c/p\u003e\n\u003cdiv\u003e\u003ciframe width\u003d\"500\" height\u003d\"281\" src\u003d\"https://www.youtube.com/embed/bcieDAwjC_g?feature\u003doembed\" frameborder\u003d\"0\" allowFullScreen\u003d\"\"\u003e\u003c/iframe\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003cdiv\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/bos-capcom-eropa-ketakutan-resident-evil-7/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Bos Capcom Eropa Ungkapkan Ketakutannya saat Memainkan Resident Evil 7 VR \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/resident-evil-7-tetap-ada-senjata-api/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Resident Evil 7 Dipastikan Tetap akan Menghadirkan Senjata Api di Dalamnya \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/dead-rising-4-xbox-one-windows-10/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Dead Rising 4 akan Hadir Eksklusif di Xbox One dan Windows 10 \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e \n\u003c/div\u003e   \u003cp\u003eThe post \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id/capcom-bocorkan-project-palm/\"\u003eCapcom Bocorkan Proyek Terbarunya, Berjudul Project Palm\u003c/a\u003e appeared first on \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id\"\u003eINIGAME\u003c/a\u003e.\u003c/p\u003e","categories":["News","capcom","project palm"]},{"title":"Dengan Kalkulator Pokemon GO INI, Gamers dapat Menghitung Potensi CP Setiap Evolusi Pokemon","link":"https://www.inigame.id/gamers-bisa-menghitung-potensi-evolusi-pokemon-go/","author":"Theofilus Ifan","publishedDate":"Fri, 29 Jul 2016 22:29:48 -0700","contentSnippet":"INIGAME.ID \u0026#8211; Saat bermain Pokemon GO, tidak jarang gamers gagal mendapatkan Pokemon terkuat saat dievolusi. Jika setelah ...","content":"\u003cp\u003e\u003cstrong\u003eINIGAME.ID –\u003c/strong\u003e Saat bermain Pokemon GO, tidak jarang \u003cem\u003egamers\u003c/em\u003e gagal mendapatkan Pokemon terkuat saat dievolusi. Jika setelah melakukan evolusi ternyata \u003cem\u003egamers\u003c/em\u003e malah menemukan Pokemon yang CP-nya jauh di atas Pokemon tadi, \u003cem\u003ecandy\u003c/em\u003e pun rasanya terbuang sia-sia.\u003c/p\u003e\n\u003cp\u003eNamun jangan khawatir, karena sekarang \u003cem\u003egamers\u003c/em\u003e bisa menghitung potensi keberhasilan saat mengevolusi monster.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href\u003d\"http://pogotoolkit.com/\"\u003ePoGoToolKit\u003c/a\u003e\u003c/strong\u003e adalah solusinya. Sistem ini mirip seperti kalkulator yang dapat menghitung potensi Combat Power (CP) setiap evolusi Pokemon.\u003c/p\u003e\n\u003cp\u003eCara kerjanya cukup mudah. \u003cem\u003eGamers\u003c/em\u003e tinggal masukan nama Pokemon apa yang ingin dievolusi, lalu masukan CP yang Pokemon tersebut punya. Kemudian sistem akan menghitung rasio keberhasilannya.\u003c/p\u003e\n\u003cp\u003e\u003cimg src\u003d\"https://www.inigame.id/wp-content/uploads/2016/07/pokemon-go-toolkit-.jpg\" alt\u003d\"pokemon go toolkit\" width\u003d\"700\" height\u003d\"412\"\u003e\u003c/p\u003e\n\u003cp\u003eBagi \u003cem\u003egamers\u003c/em\u003e yang belum tahu, setiap Pokemon memiliki CP yang bisa dikalikan untuk berevolusi. Itu sebabnya 105 CP Magikarp bisa berubah ke 1000+ CP Gyarados.\u003c/p\u003e\n\u003cp\u003eSedangkan 105 CP Rattata hanya akan berevolusi menjadi 250 CP Raticate. Di sinilah PoGoToolKit hadir untuk memberi masukan tentang evolusi Pokemon.\u003c/p\u003e\n\u003cp\u003eSatu hal yang perlu diingat, perhitungan ini bukan standar yang tetap. Sehingga masih ada kemungkinan CP Pokemon yang dievolusi melenceng dari dugaan.\u003c/p\u003e\n\u003cp\u003eNamun, setidaknya kalkulator evolusi bisa menjadi bahan pertimbangan sebelum mengevolusi monster, dan \u003cem\u003ecandy\u003c/em\u003e pun tidak terbuang dengan sia-sia.\u003c/p\u003e\n\u003cp\u003eBagaimana, tertarik mencobanya, \u003cem\u003egamers\u003c/em\u003e? Berikut adalah video tips dan trik dalam bermain Pokemon GO. Semoga membantu ya!\u003c/p\u003e\n\u003cdiv\u003e\u003ciframe width\u003d\"500\" height\u003d\"281\" src\u003d\"https://www.youtube.com/embed/Q6QGsQe90Ms?feature\u003doembed\" frameborder\u003d\"0\" allowFullScreen\u003d\"\"\u003e\u003c/iframe\u003e\u003c/div\u003e\n\u003cdiv\u003e\u003cdiv\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/pria-dapatkan-perjalanan-gratis-pokemon-go/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Pria INI Dapatkan Perjalanan Gratis ke Seluruh Dunia untuk Melengkapi Koleksi Po... \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/capai-lv-40-di-pokemon-go-gamers-ini-langsung-hapus-akun/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Capai Lv 40 di Pokemon Go, Gamers INI Langsung Hapus Akun \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/pokemon-go-plus-diundur-sampai-september-2016/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Pokemon GO Plus Diundur sampai September 2016 \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e \n\u003c/div\u003e   \u003cp\u003eThe post \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id/gamers-bisa-menghitung-potensi-evolusi-pokemon-go/\"\u003eDengan Kalkulator Pokemon GO INI, Gamers dapat Menghitung Potensi CP Setiap Evolusi Pokemon\u003c/a\u003e appeared first on \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id\"\u003eINIGAME\u003c/a\u003e.\u003c/p\u003e","categories":["News","pokémon go!"]},{"title":"DotA 2 Hadirkan Players Card Packs untuk Fitur “Fantasy Team”","link":"https://www.inigame.id/dota-2-players-card-packs-fantasy-team/","author":"David Christiantho","publishedDate":"Fri, 29 Jul 2016 19:51:36 -0700","contentSnippet":"INIGAME.ID \u0026#8211; Menyambut The International yang semakin dekat, Valve bersama DotA 2 mengajak gamers untuk bermain kartu ...","content":"\u003cp\u003e\u003cstrong\u003eINIGAME.ID \u003c/strong\u003e– Menyambut The International yang semakin dekat, Valve bersama DotA 2 mengajak \u003cem\u003egamers \u003c/em\u003euntuk bermain kartu untuk membuat Fantasy Team atau tim impian masing-masing \u003cem\u003egamers\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003eBagi \u003cem\u003egamers \u003c/em\u003eyang telah memiliki Battle Pass akan menerima 15 Players Card Packs, di mana\u003cem\u003e \u003c/em\u003esetiap satu Card Pack\u003cem\u003e \u003c/em\u003eakan berisi 5 Random Player Cards\u003cem\u003e.\u003c/em\u003e Nantinya akan terdiri dari 3 jenis kartu Bronze, Silver, dan Gold\u003cem\u003e.\u003c/em\u003e Bagi\u003cem\u003e gamers\u003c/em\u003e yang ingin mengoleksi juga dapat membeli Player Card Packs di \u003cstrong\u003e\u003ca href\u003d\"http://steamcommunity.com/market/listings/570/2016%20Player%20Card%20Pack\"\u003eSteam Market\u003c/a\u003e\u003ci\u003e \u003c/i\u003e\u003c/strong\u003eseharga kurang lebih US$0,5 (sekitar Rp7.000,-).\u003c/p\u003e\n\u003cdiv style\u003d\"width:710px\"\u003e\u003cimg src\u003d\"https://www.inigame.id/wp-content/uploads/2016/07/dota-2-opening-card.jpg\" alt\u003d\"player card packs\" width\u003d\"700\" height\u003d\"224\"\u003e\u003cp\u003ePlayer Card Packs The International 2016\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eKalau \u003cem\u003egamers \u003c/em\u003etidak ingin membelinya, bisa juga dengan cara melakukan \u003cem\u003erecycle \u003c/em\u003eterhadap kartu-kartu yang sama. Untuk kartu Bronze\u003cem\u003e \u003c/em\u003esetara dengan 1 \u003cem\u003edust,\u003c/em\u003e Silver\u003cem\u003e \u003c/em\u003esetara dengan 2 \u003cem\u003edust, \u003c/em\u003edan Gold\u003cem\u003e \u003c/em\u003esetara dengan 5 \u003cem\u003edust. \u003c/em\u003eNantinya setiap 10 \u003cem\u003edust \u003c/em\u003edapat ditukarkan dengan 1 Player Card Pack\u003cem\u003e. \u003c/em\u003ePada Silver Cards\u003cem\u003e \u003c/em\u003edan Gold Cards\u003cem\u003e \u003c/em\u003eterdapat \u003cem\u003ebonus stat \u003c/em\u003euntuk menambah \u003cem\u003escore \u003c/em\u003eketika kartu tersebut digunakan.\u003c/p\u003e\n\u003cdiv style\u003d\"width:710px\"\u003e\u003cimg src\u003d\"https://www.inigame.id/wp-content/uploads/2016/07/scoring.jpg\" alt\u003d\"dota 2 fantasy team\" width\u003d\"700\" height\u003d\"271\"\u003e\u003cp\u003eDota 2 Fantasy Team\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eDan seperti yang telah disampaikan tadi, Player Cards berfungsi untuk menyusun pemain dalam DotA 2 Fantasy Team\u003cem\u003e. \u003c/em\u003e\u003cem\u003eGamers \u003c/em\u003eakan memilih 3 \u003cem\u003ecore players \u003c/em\u003edan 2 \u003cem\u003esupport players \u003c/em\u003eberdasarkan kartu yang dimiliki. Setiap hasil permainan akan memberikan \u003cem\u003escore \u003c/em\u003eyang nantinya akan diakumulasikan untuk dijadikan Battle Points.\u003c/p\u003e\n\u003cp\u003eDotA 2 Fantasy Team\u003cem\u003e \u003c/em\u003edapat \u003cem\u003egamers \u003c/em\u003eganti setiap waktunya untuk menyesuaikan pemain dengan pertandingan hari itu. Sepertinya para atlet eSports kini semakin mirip seperti atlet olahraga konvensional ya, \u003cem\u003egamers\u003c/em\u003e?\u003c/p\u003e\n\u003cdiv\u003e\u003cdiv\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/dota-2-tambahkan-vr-spectator-mode/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Sambut The International 2016, DotA 2 Fitur Spectator dalam Format VR \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/the-international-2016-hadirkan-prizepool-mencapai-rp260-miliar-terbesar-sepanjang-sejarah-esports/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e The International 2016 Hadirkan Prizepool Mencapai Rp260 Miliar, Terbesar Sepanj... \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/immortal-treasure-iii-mengecewakan/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Benarkah Konten Immortal Treasure III Mengecewakan? \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e \n\u003c/div\u003e   \u003cp\u003eThe post \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id/dota-2-players-card-packs-fantasy-team/\"\u003eDotA 2 Hadirkan Players Card Packs untuk Fitur “Fantasy Team”\u003c/a\u003e appeared first on \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id\"\u003eINIGAME\u003c/a\u003e.\u003c/p\u003e","categories":["eSports","dota 2","fantasy team","player cards"]},{"title":"Sambut The International 2016, DotA 2 Fitur Spectator dalam Format VR","link":"https://www.inigame.id/dota-2-tambahkan-vr-spectator-mode/","author":"David Christiantho","publishedDate":"Fri, 29 Jul 2016 19:39:55 -0700","contentSnippet":"INIGAME.ID \u0026#8211; Virtual Reality (VR) kini sudah tidak terdengar asing bagi gamers bukan? Popularitas VR membuat berbagai ...","content":"\u003cp\u003e\u003cstrong\u003eINIGAME.ID \u003c/strong\u003e– Virtual Reality (VR) kini sudah tidak terdengar asing bagi \u003cem\u003egamers \u003c/em\u003ebukan? Popularitas VR membuat berbagai perusahaan \u003cem\u003egame \u003c/em\u003etidak mau kalah saing. Begitu pula dengan DotA 2, yang kini memiliki fitur VR untuk \u003cem\u003espectator mode.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eDengan hanya menggunkan Steam VR dan memasangkan \u003cem\u003eheadset,\u003c/em\u003e segala kebutuhan \u003cem\u003egamers \u003c/em\u003euntuk melakukan \u003cem\u003espectating \u003c/em\u003e\u003cem\u003ematch\u003c/em\u003e dijamin akan menjadi lebih seru.\u003c/p\u003e\n\u003cp\u003e\u003cimg src\u003d\"https://www.inigame.id/wp-content/uploads/2016/07/dota-vr-spectate-mode.jpg\" alt\u003d\"dota 2 vr hub\" width\u003d\"700\" height\u003d\"394\"\u003e\u003c/p\u003e\n\u003cp\u003ePada saat menggunakan Dota 2 VR Hub untuk melakukan \u003cem\u003espectate\u003c/em\u003e, \u003cem\u003egamers \u003c/em\u003eakan seolah-olah berada di dalam sebuah bioskop yang sedang menonton DotA 2 secara eksklusif. Pada saat melakukan \u003cem\u003espectate, \u003c/em\u003e\u003cem\u003egamers \u003c/em\u003ejuga akan diberikan pilihan untuk menonton dari atas atau seolah-olah \u003cem\u003egamers \u003c/em\u003eberpijak di dataran, sama seperti para \u003cem\u003ehero\u003c/em\u003e yang sedang bertanding.\u003c/p\u003e\n\u003cp\u003eTidak hanya itu, \u003cem\u003egamers \u003c/em\u003ejuga diberi pilihan untuk menonton dari jauh atau dari dekat, sesuai dengan cara dan seleranya sendiri. Penasaran akan seperti apa jadinya? Langsung saja simak video berikut.\u003c/p\u003e\n\u003cp\u003e\u003ciframe src\u003d\"https://www.youtube.com/embed/4xBsSTS57k8\" width\u003d\"560\" height\u003d\"315\" frameborder\u003d\"0\" allowFullScreen\u003d\"allowfullscreen\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThanks to \u003c/em\u003e\u003ca href\u003d\"http://steamed.kotaku.com/dota-2-adds-vr-spectator-mode-1784488872?utm_source\u003dfeedburner\u0026amp;utm_medium\u003dfeed\u0026amp;utm_campaign\u003dFeed%3A+kotaku%2Ffull+%28Kotaku%29\"\u003e\u003cstrong\u003eKotaku\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cdiv\u003e\u003cdiv\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/dota-2-players-card-packs-fantasy-team/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e DotA 2 Hadirkan Players Card Packs untuk Fitur “Fantasy Team” \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/the-international-2016-hadirkan-prizepool-mencapai-rp260-miliar-terbesar-sepanjang-sejarah-esports/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e The International 2016 Hadirkan Prizepool Mencapai Rp260 Miliar, Terbesar Sepanj... \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\n\t\t\t\t\t\u003cdiv\u003e  \n\t\t\t\t\t\t\u003ca href\u003d\"https://www.inigame.id/immortal-treasure-iii-mengecewakan/\" style\u003d\"font-size:13px;font-weight:bold;line-height:21px\"\u003e Benarkah Konten Immortal Treasure III Mengecewakan? \u003c/a\u003e\n\t\t\t\t\t\t\t  \n\t\t\t\t\t\u003c/div\u003e\u003c/div\u003e \n\u003c/div\u003e   \u003cp\u003eThe post \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id/dota-2-tambahkan-vr-spectator-mode/\"\u003eSambut The International 2016, DotA 2 Fitur Spectator dalam Format VR\u003c/a\u003e appeared first on \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id\"\u003eINIGAME\u003c/a\u003e.\u003c/p\u003e","categories":["eSports","dota 2","steam vr","vr hub"]},{"title":"Remedy Entertainment Umumkan Hadirnya CrossFire 2","link":"https://www.inigame.id/remedy-entertainment-umumkan-hadirnya-crossfire-2/","author":"Jane Lorenti","publishedDate":"Fri, 29 Jul 2016 00:37:13 -0700","contentSnippet":"INIGAME.ID \u0026#8211; Remedy Entertainment yang merupakan studio di balik game third-person shooter, Alan Wake dan Quantum Break, ...","content":"\u003cp\u003e\u003cstrong\u003eINIGAME.ID –\u003c/strong\u003e Remedy Entertainment yang merupakan studio di balik game \u003cem\u003ethird-person shooter\u003c/em\u003e, Alan Wake dan Quantum Break, telah menjalin kerja sama dengan perusahaan game asal Korea yaitu Smilegate untuk mengembangkan CrossFire 2 yang merupakan sekuel dari game \u003cem\u003efirst-person shooter\u003c/em\u003e, CrossFire.\u003c/p\u003e\n\u003cdiv style\u003d\"width:710px\"\u003e\u003cimg src\u003d\"https://www.inigame.id/wp-content/uploads/2016/07/remedy-dan-smilegate-bekerja-sama-untuk-mendevelop-crossfire-2-artikel2-.jpg\" alt\u003d\"cross fire\" width\u003d\"700\" height\u003d\"429\"\u003e\u003cp\u003eCross Fire\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003ePihak Remedy mengatakan bahwa\u003cem\u003e ” Seluruh tim Remedy sangat antusias untuk menjadi partner Smilegate dalam mengembangkan game CrossFire ini. \u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSmilegate secara khusus memilih Remedy untuk membawa keunikan kami ke dalam storytelling, karakter yang memorable dan inventif bagi para gamers khususnya fans CrossFire. “\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e” Kami sudah mulai mengembangkan projek ini dan kami sangat bersemangat untuk membagikan apa yang sedang kami kerjakan kepada para gamers. Jadi tetap pantau kami dalam pengembangan game ini. “\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eCrossfire pertama kali di rilis pada tahun 2007 . Sejak di rilis, game ini menjadi salah satu dari game\u003cem\u003e first-person shooter\u003c/em\u003e yang paling banyak dimainkan di seluruh dunia. Sedangkan CrossFire 2 sendiri diharapkan akan mendapatkan respon yang sama dari para \u003cem\u003egamers\u003c/em\u003e.\u003c/p\u003e\n\u003cdiv style\u003d\"width:710px\"\u003e\u003cimg src\u003d\"https://www.inigame.id/wp-content/uploads/2016/07/remedy-dan-smilegate-bekerja-sama-untuk-mendevelop-crossfire-2-artikel1-.jpg\" alt\u003d\"cross fire\" width\u003d\"700\" height\u003d\"379\"\u003e\u003cp\u003eCross Fire\u003c/p\u003e\u003c/div\u003e\n\u003cp\u003eBelum ada kabar pasti mengenai tanggal perilisan CrossFire 2, Remedy mengatakan bahwa saat ini mereka sedang mengerjakan dua game baru sejak bulan lalu.\u003c/p\u003e\n\u003cp\u003eThanks to \u003ca href\u003d\"http://www.videogamer.com/xboxone/quantum_break/news/quantum_break_studio_remedy_co-developing_crossfire_2.html\"\u003e\u003cstrong\u003eVideogamer\u003c/strong\u003e\u003c/a\u003e , \u003ca href\u003d\"http://www.polygon.com/2016/7/27/12303804/crossfire-2-remedy-entertainment-smilegate\"\u003e\u003cstrong\u003ePolygon\u003c/strong\u003e\u003c/a\u003e dan \u003ca href\u003d\"http://www.pcgamer.com/remedy-is-developing-the-story-mode-for-upcoming-fps-crossfire-2/\"\u003e\u003cstrong\u003ePC Gamer\u003c/strong\u003e\u003c/a\u003e\u003c/p\u003e\n\u003cdiv\u003e\n\u003c/div\u003e   \u003cp\u003eThe post \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id/remedy-entertainment-umumkan-hadirnya-crossfire-2/\"\u003eRemedy Entertainment Umumkan Hadirnya CrossFire 2\u003c/a\u003e appeared first on \u003ca rel\u003d\"nofollow\" href\u003d\"https://www.inigame.id\"\u003eINIGAME\u003c/a\u003e.\u003c/p\u003e","categories":["News","crossfire 2","remedy entertainment","smilegate"]}]}}, "responseDetails": null, "responseStatus": 200}